Repository: jimregan/citizens-information-raw
Catalog: en-ro/www.citizensinformation.ie/ro/moving_country/moving_to_ireland/introduction_to_the_irish_system/accommodation.html.txt.tmx
Source language: en
Languages: ro

source: You should arrange accommodation before you arrive in Ireland, even for the first few days of your stay
ro: Mutarea dintr-o tara în alta este îndeajuns de stresanta chiar si fara efortul de a gasi o locuinta atunci când sositi

source: Organise in advance to stay with friends or book yourself in to a hotel or a hostel in order to give yourself time to look around and get to grips with the accommodation situation in the area in which you plan to live. Buying a house
ro: Cu atât mai mult daca sositi în Dublin, unde cazarea este costisitoare iar oferta mica. Este de preferat sa rezolvati aceasta problema înainte de sosirea în tara, chiar daca numai pentru primele zile ale sederii Dv

source: If you are thinking of buying a house, you need to be aware of the price trends in this country, the process by which houses are bought and sold and the initial costs that are involved
ro: Aranjati din timp sa stati la prieteni sau rezervati-va loc la un hotel sau camin pentru a avea timp sa analizati mai multe oferte si sa va acomodati cu situatia cazarii în zona în care planificati sa locuiti

source: Rented accommodation comes in many forms. You can choose from houses, flats, apartments, house-shares and bed-sits, according to what suits your needs and your budget. You will need to know how these are advertised and rented and what your rights and responsibilities are as a tenant
ro: Daca va gânditi sa cumparati o casa, trebuie sa fiti la curent cu tendintele preturilor din aceasta tara, cu procesele prin care sunt cumparate si vândute casele si costurile initiale pe care aceste procese le presupun

source: Local authorities are the main providers of social housing for people who cannot afford to buy their own homes
ro: Închirierea unei locuinte poate îmbraca mai multe forme

source: Non-Irish nationals must have a legal right to remain in the State on a long-term basis to be eligible to apply for social housing
ro: Veti putea alege între mai multe case, apartamente, camere, locuinte la comun si garsoniere, în functie de necesitatile si bugetul Dv

source: Detailed rules are contained in Circular Housing 41/2012 Access to social housing supports for non-Irish nationals (pdf)
ro: Va trebui sa fiti la curent cu modalitatile prin care se fac anunturile si închirierile, precum si cu drepturile si responsabilitatile Dv

source: Threshold is a voluntary organisation that gives information and advice to citizens about rented accommodation
ro: Threshold, o organizaţie de voluntari oferă sprijin cetăţenilor, altora decât irlandezi, care nu au adăpost, sunt pe cale să îşi piardă adăpostul sau celor care au nevoie de sfaturi pentru găsirea de adăpost conform drepturilor la adăpost ale fiecăruia
